<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Lab 1</title>
</head>
<body>
    <p style="color: green; font-weight:bold">Лабораторная работа №1 <br></p>
    <?php
        echo "Выполнил студент Малютина Ю.В.<br>";
        echo "-------------------------------------------------<br><br>";

        echo "Задача - Вычислить сумму длин рёбер параллелепипеда<br>";

        echo "Формула - S = 4a + 4b + 4c <br>";

        $a = 2;
        $b = 5;
        $c = 4;

        echo "<br>Начальные данные:";
        echo "<br>Длина (a) = " . $a;
        echo "<br>Ширина (b) = " . $b;
        echo "<br>Высота (c) = " . $c;

        if($a <= 0 || $b <= 0 || $c <= 0){
            echo "<br><br>Расчет суммы длин рёбер параллелепипеда невозможен, т.к. длина ребра не может быть равной или меньше нуля.<br>Проверьте значения и запустите программу повторно.";
        } else {
            $S = 4*$a + 4*$b + 4*$c;
            echo "<br><br>Cумма длин рёбер параллелепипеда равна " . $S;
        }

        echo "<br><br>-------------------------------------------------<br>";
        echo "Измененные значения:";
        echo "<br>-------------------------------------------------<br>";

        $a=pow($a,5);
        $b+=$c;
        $c=$c+$a+=$b;

        echo "<br>Длина (a) = " . $a;
        echo "<br>Ширина (b) = " . $b;
        echo "<br>Высота (c) = " . $c;

        $S = 4*$a + 4*$b + 4*$c;
        echo "<br><br>Cумма длин рёбер параллелепипеда равна " . $S;
    ?>
</body>
</html>